In [14]:
import pandas as pd

In [3]:
# Ans 3
data = {'Name':['Alice','Bob','Claire'],
     'Age':[25,30,27],
        'Gender':['Female','Male','Female']}
df = pd.DataFrame(data)

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [5]:
# Ans 1

a = [4,8,15,16,23,42]

S = pd.Series(a)

print(S)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
# Ans 2

lst = [1,2,55,96.45,456,'Ankit','Kumar','Pwskills','Skills','raj']

x = pd.Series(lst)

print(x)

0           1
1           2
2          55
3       96.45
4         456
5       Ankit
6       Kumar
7    Pwskills
8      Skills
9         raj
dtype: object

In [ ]:
# Ans 4

pandas.Series - Series in pandas contains a single list which can store heterogeneous type of data, because of this, series is also considered as a 1-dimensional data structure. 

DataFrame - DataFrame is a 2-dimensional data structure which contains multiple lists of heterogeneous type of data.

In [4]:
#Example of data series 

data = {
    'Calories':[120,450,600],
    'duration':[10,40,60]
}

df = pd.DataFrame(data)

In [5]:
df

   Calories  duration
0       120        10
1       450        40
2       600        60

In [6]:
# Example of pandas.series

a = [45,41,7]

m = pd.Series(a)

print(m)

0    45
1    41
2     7
dtype: int64

In [ ]:
# Ans 5

Some common function use to manupulate data are :
    dropping column
    dropping row 
    slicing
    renaming a column

In [15]:

df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [16]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [17]:
# Example of column drop

# not for permanent change

df = df.drop('Survived' , axis = 1)

In [20]:
# Example of row drop 
# Not for permanent change


df = df.drop(2)

In [ ]:
# example of slicing

df[['Pclass' , 'Name' ]][4:50:2]

In [25]:
# Example of renaming

df.rename(columns = {'PassengerId':'Customer id '} , inplace = True)

In [ ]:
# Ans 7

we can create a DataFrame from multiple series objects by adding each series as a columns.

In [28]:
#Example 

df2 = df[['Name' , 'Age']][0:5]

In [29]:
df3 = df[['Name', 'Age']][5:10]

In [34]:
pd.concat([df2,df3])

                                                 Name   Age
0                             Braund, Mr. Owen Harris  22.0
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                            Allen, Mr. William Henry  35.0
5                                    Moran, Mr. James   NaN
6                             McCarthy, Mr. Timothy J  54.0
7                      Palsson, Master. Gosta Leonard   2.0
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                 Nasser, Mrs. Nicholas (Adele Achem)  14.0
10                    Sandstrom, Miss. Marguerite Rut   4.0

In [ ]:
#Ans 6
Series , DataFrame , Panel all are mutable in nature.